cases/case_1p0_ke/0/R
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (4e-08 -0 -0 4e-08 -0 4e-08);

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           uniform (4e-08 -0 -0 4e-08 -0 4e-08);
    }
    defaultFaces
    {
        type            empty;
    }
    topWall
    {
        type            calculated;
        value           uniform (4e-08 0 -0 4e-08 -0 4e-08);
    }
    outlet
    {
        type            cyclic;
    }
    inlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
