cases/case_1p0_ke/0/TauDNS
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      TauDNS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
10981
(
(4.65927e-06 -1.19405e-07 0 6.88768e-08 0 2.40117e-06)
(1.65017e-05 -5.00397e-07 0 3.23659e-07 0 7.66647e-06)
(2.94449e-05 -1.13811e-06 0 8.03423e-07 0 1.1661e-05)
(5.07774e-05 -2.36886e-06 0 1.71727e-06 0 1.7903e-05)
(6.81377e-05 -3.50311e-06 0 2.66492e-06 0 2.21329e-05)
(7.40646e-05 -3.94429e-06 0 3.236e-06 0 2.55164e-05)
(7.31536e-05 -3.92215e-06 0 3.71717e-06 0 2.98841e-05)
(6.2962e-05 -3.32463e-06 0 4.65936e-06 0 3.6997e-05)
...
)
;

boundaryField
{
    bottomWall
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
    topWall
    {
        type            zeroGradient;
    }
    outlet
    {
        type            cyclic;
    }
    inlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
