cases/case_1p0_ke/0/UDNS
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UDNS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
10981
(
(0.000469516 4.10019e-06 -2.78102e-06)
(0.00179474 1.45871e-05 -1.02639e-05)
(0.00351561 2.70494e-05 -1.91621e-05)
(0.00672944 7.29326e-05 -3.63245e-05)
(0.0112575 0.000184392 -6.57814e-05)
(0.0144861 0.000304087 -8.82726e-05)
(0.0177814 0.000501439 -0.000111429)
(0.0220915 0.000861973 -0.000141033)
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    defaultFaces
    {
        type            empty;
    }
    topWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            cyclic;
    }
    inlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
