cases/case_1p0_ke/0/V
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      V;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
14751
(
3.63638e-05
3.63637e-05
3.63639e-05
3.63644e-05
3.63651e-05
3.63658e-05
3.63663e-05
3.63667e-05
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.00971063
0.00970498
0.00969666
0.0096943
0.00970516
0.00970906
0.00971027
0.00971061
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.00909091
0.00909091
0.00909091
0.00909091
0.00909091
0.00909091
0.00909091
0.00909091
...
)
;
    }
}


// ************************************************************************* //
