cases/case_1p0_ke/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 6e-08;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            kLowReWallFunction;
        Ceps2           1.9;
        Ck              -0.416;
        Bk              8.366;
        C               11;
        value           uniform 6e-08;
    }
    bottomWall
    {
        type            kLowReWallFunction;
        Ceps2           1.9;
        Ck              -0.416;
        Bk              8.366;
        C               11;
        value           uniform 6e-08;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
